# March 1st Note (value_counts)

In [5]:
import pandas as pd

df =  pd.read_csv('grades.csv')
df

        name  q1  q2  q3  t1  t2  final grade
0       amit   4   2   5  87  23     59     A
1  bearegard   3   4   2  78  34     67     B
2     cecily   3   5   3  34  40     65     B
3    deshaun   5   5   5  40  39     69     A
4  esmeralda   4   3   4  37  34     55     C

In [6]:
s_y = df['grade']
s_y

0    A
1    B
2    B
3    A
4    C
Name: grade, dtype: object

In [7]:
# now drop the target column
df = df.drop(columns=['grade'])
df

        name  q1  q2  q3  t1  t2  final
0       amit   4   2   5  87  23     59
1  bearegard   3   4   2  78  34     67
2     cecily   3   5   3  34  40     65
3    deshaun   5   5   5  40  39     69
4  esmeralda   4   3   4  37  34     55

In [8]:
df['q1'] == 3

0    False
1     True
2     True
3    False
4    False
Name: q1, dtype: bool

In [10]:
df[ df['q1']==3 ]

        name  q1  q2  q3  t1  t2  final
1  bearegard   3   4   2  78  34     67
2     cecily   3   5   3  34  40     65

In [11]:
# since the target col has the same row dimension, we can do the same thing here
s_y[ df['q1']==3 ]

1    B
2    B
Name: grade, dtype: object

In [12]:
s_y.value_counts()

B    2
A    2
C    1
Name: grade, dtype: int64

In [13]:
# with normalize = True -> we can get the probability of being in that class label
s_y.value_counts(normalize=True)

B    0.4
A    0.4
C    0.2
Name: grade, dtype: float64